# XMLSAXEndDocMemory

## Description
Write XML using SAX, end of a document.  XMLSAXBeginDocMemory begins a document.

```pascal
FUNCTION XMLSAXEndDocMemory(
				XMLHandle   : LONGINT;
				VAR XMLData : DYNARRAY[] of CHAR): INTEGER;
```

```python
def vs.XMLSAXEndDocMemory(XMLHandle):
    return (INTEGER, XMLData)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT|   |
|XMLData|DYNARRAY[] of CHAR|   |

## Examples
XMLSAXBeginDocMemory.

```pascal
resultN := XMLSAXEndDocMemory(1, XMLData);
```
```python
import vs

# Write XML using SAX, end of a document.
XMLHandle = 1

resultN, XMLData = vs.XMLSAXEndDocMemory(XMLHandle)
vs.Message('XMLSAXEndDocMemory returned: ' + str((resultN, XMLData)))
```

## See Also
InitXML | ReleaseXML

XMLSAXBeginDocMemory | XMLSAXBeginNode | XMLSAXEndNode | XMLSAXAddNodeAttr | XMLSAXAddNodeValue

## Version
Availability: from Vectorworks 2011

## Category
* XML SAX